# Получатель
RASHOD_DECL = [
    ('G141',      'C',   9, 0),      # УНП Витязя, 300031652
    ('G142',      'C',  38, 0),      # Получатель, РУПП "Витязь"
    ('G143',      'C',  76, 0),      # Адрес, "РБ, 210605, Г.ВИТЕБСК, УЛ.П.БРОВКИ 13А"
    ('G549',      'C',  18, 0),      # Порядковый номер, ClearanceInvoice.id
    ('G542',      'D',   8, 0),      # Дата формирования, ClearanceInvoice.date_calc (оставляем только дату без времени)
    ('G022',      'C',  38, 0),      # Пусто
    ('G082',      'C',  38, 0),      # Страна, БЕЛАРУСЬ
    ('G05',       'N',   3, 0),      # Пусто
    ('DOP_NOMER', 'C',   8, 0),      # Вводит пользователь, ClearanceInvoice.ttn
    ('NOMER_GTD', 'C',   6, 0),      # Порядковый номер, ClearanceInvoice.id
    ('G013',      'C',   2, 0),      # Везде 1
]